hybrid_method/default_fv_case/fully_resolved/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-30;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
		Prt				0.72; 
    }
    outlet
    {
        type            calculated;
        value           $internalField;
		Prt				0.72;
    }
     atmosphere
    {
        type            calculated;
        value           $internalField;
		Prt				0.72;
    }
     "nac_.*"
    {
      type            boundaryCorrectedFixedValue; 
      value           $internalField;
    }
    "fuse_.*"
    {
        type            boundaryCorrectedFixedValue; 
        value           $internalField;    
	}    
    wedge_left
    {
		type 		    wedge;
    }	
    wedge_right
    {
	    type 		    wedge;
    }	
}
// ************************************************************************* //
