hybrid_method/default_fv_case/fully_resolved/0/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object k;
}

#include "include/freestreamConditions"
dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $k;

boundaryField
{
  inlet
  {
    type turbulentIntensityKineticEnergyInlet;
    intensity $intensity;
    value $internalField;
  }
  outlet
  {
    type zeroGradient;
  }
  atmosphere
  {
    type zeroGradient;
  } 	
     "nac_.*"
  {
    type boundaryCorrectedFixedValue;
    value uniform 0;
  }
    "fuse_.*"
  {
    type boundaryCorrectedFixedValue;
    value uniform 0;
  }
    wedge_left
    {
		type 		    wedge;
    }
	
    wedge_right
    {
	    type 		    wedge;
    }
} 	// ************************************************************************* //

