hybrid_method/default_fv_case/fully_resolved/0/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object omega;
}

#include "include/freestreamConditions"
dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform $omega;

boundaryField
{
  inlet
  {
    type 			turbulentMixingLengthFrequencyInlet;
    mixingLength 	$mixingLength;
    value 			$internalField;
  }
  outlet
  {
    type 			zeroGradient;
  }
  atmosphere
  {
    type 			zeroGradient;
  }
     "nac_.*"
  {
    type omegaWallFunction;
    Cmu 0.09;
    kappa 0.41;
    E 9.8;
    beta1 0.075;
    value uniform 10;
  }
    "fuse_.*"
  {
    type omegaWallFunction;
    Cmu 0.09;
    kappa 0.41;
    E 9.8;
    beta1 0.075;
    value uniform 10;
  }
    wedge_left
    {
		type 		    wedge;
    }	
    wedge_right
    {
	    type 		    wedge;
    }
} 	// ************************************************************************* //

